app/controllers/advanced_items_controller.rb

    def index
        advItems = AdvancedItem.all
---
SELECT "advanced_items".* FROM "advanced_items"
SELECT "items".* FROM "items"