app/controllers/characters_controller.rb

    def index
        char = Character.first
---
SELECT "characters".* FROM "characters" ORDER BY "characters"."id" ASC LIMIT $1  [["LIMIT", 1]]