app/controllers/inventories_controller.rb

    def index
        inv = Inventory.first
---
SELECT "inventories".* FROM "inventories" ORDER BY "inventories"."id" ASC LIMIT $1  [["LIMIT", 1]]