app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        items = Item.all

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
UPDATE "items" SET "inventory_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["inventory_id", 15], ["updated_at", "2020-07-29 14:33:37.260465"], ["id", 38]]
---
    def update
        item = Item.find(params[:id])
        item.update!(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
    def show
        item = Item.find(params[:id])