app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
    def index
        rooms = Room.all